{
  "version": "2.3",
  "date": "2026-01-27",
  "downloadUrl": "https://drive.google.com/uc?export=download&id=1nxsXmvEhv1_nyp8HrLvVvEZhxJdQfkEY",
  "downloadFileName": "FlowForge_2701.zip",
  "tags": ["bugfix", "critical", "improvement"],
  "title": {
    "vi": "Sửa lỗi Tab Ảnh & Lỗi Trùng Lặp Script",
    "en": "Fix Image Tab & Duplicate Injection Error"
  },
  "summary": {
    "vi": "Bản cập nhật quan trọng sửa các lỗi nghiêm trọng tại Tab Ảnh và lỗi lặp lại việc nhúng script gây sập tiện ích.",
    "en": "Critical update fixing serious bugs in Image Tab and duplicate script injection that caused extension crash."
  },
  "sections": [
    {
      "type": "bugfix",
      "emoji": "🐛",
      "title": { "vi": "Sửa Lỗi", "en": "Bug Fixes" },
      "items": [
        {
          "class": "fix",
          "vi": "<strong>Sửa chế độ \"Chỉ Tạo\" (Tab Ảnh):</strong> Khắc phục lỗi chế độ Chỉ Tạo không hoạt động, giờ đây bạn có thể tạo ảnh hàng loạt mà không cần tải xuống.",
          "en": "<strong>Fix \"Create Only\" Mode (Image Tab):</strong> Fixed Create Only mode not working. Now you can batch create images without downloading."
        },
        {
          "class": "fix",
          "vi": "<strong>Sửa lỗi Trùng Lặp Script:</strong> Khắc phục lỗi tiện ích bị sập khi mở Sidepanel nhiều lần. Hệ thống giờ đây kiểm tra và tránh nhúng script trùng lặp.",
          "en": "<strong>Fix Duplicate Injection Error:</strong> Fixed extension crash when opening Sidepanel multiple times. System now checks and prevents duplicate script injection."
        },
        {
          "class": "fix",
          "vi": "<strong>Sửa nút Sử dụng lại (Chế độ Tĩnh):</strong> Khắc phục lỗi nhấn nhầm vào ảnh thu nhỏ thay vì nút \"Sử dụng lại câu lệnh\" trong chế độ Static.",
          "en": "<strong>Fix Static Mode Reuse Button:</strong> Fixed clicking on thumbnail instead of \"Reuse prompt\" button in Static mode."
        },
        {
          "class": "fix",
          "vi": "<strong>Sửa lỗi mất kết nối:</strong> Khắc phục lỗi kênh giao tiếp bị đóng đột ngột khiến tiện ích ngừng hoạt động.",
          "en": "<strong>Fix Connection Lost:</strong> Fixed message channel closing unexpectedly causing extension to stop working."
        }
      ]
    },
    {
      "type": "improvement",
      "emoji": "🔧",
      "title": { "vi": "Cải Tiến", "en": "Improvements" },
      "items": [
        {
          "class": "improve",
          "vi": "<strong>Nhúng Script Thông Minh:</strong> Hệ thống tự động kiểm tra trước khi nhúng để tránh chạy mã nguồn hai lần.",
          "en": "<strong>Smart Script Injection:</strong> System automatically checks before injection to avoid running code twice."
        },
        {
          "class": "improve",
          "vi": "<strong>Thông Báo Lỗi Chi Tiết:</strong> Bổ sung hướng dẫn cụ thể khi kết nối thất bại, giúp người dùng dễ dàng khắc phục.",
          "en": "<strong>Better Error Messages:</strong> Added specific guidance when connection fails, helping users troubleshoot easily."
        },
        {
          "class": "improve",
          "vi": "<strong>Tải Lên Dự Phòng:</strong> Nếu nút Sử dụng lại không hoạt động, hệ thống sẽ tự động tải lại toàn bộ ảnh tham chiếu.",
          "en": "<strong>Fallback Upload:</strong> If Reuse button fails, system automatically re-uploads all reference images."
        }
      ]
    }
  ]
}
